import './layout.css';
import {Link } from "react-router-dom";

export default function BookPost(props){
    return(

        <body>
  
        <div class="topnav">
        <Link to="/">Home</Link>
        <Link to="/jams">Jams</Link>
        <Link >Coffee Space</Link>
      </div>

        <div class="bookpost_header">
          <h1>100 Years of Solitude - Sad?</h1>
        </div>

        <div class="leftcolumn_post">
          
          <h5 class="bookpost_body">Δεν ήμουν ενθουσιασμενη να διαβάσω το 100 Χρόνια Μοναξιά, δεν ήταν καν στα άμεσα σχέδια μου να το αγοράσω. Με τρόμαζε η λέξη "μοναξιά" στο τίτλο "να κάτι που θα με ψυχοπλακωσει" είχα σκεφτεί και περίμενα προτάσεις που δεν είχαν ροή και μακριές βαριές λέξεις που δείχνουν μόνο ότι ο συγγραφέας μπορεί να ανοίξει ένα λεξικό με συνώνυμα. Ήταν πολύ περίεργες σκέψεις αν σκεφτεί κανείς ότι ήδη λάτρευα την γραφή του Gabriel García Márquez από το Ο Έρωτας στα Χρόνια της Χολέρας και δεν μου φαινόταν τόσο άσχημη ιδέα αν είναι να ψυχοπλακωθω από κάτι ας ήταν από ένα βιβλίο του. Και πάλι καμία απόφαση προς την αγορά του. Και κάπως έτσι – όπως καταλήγουν να ξεκινάνε όλες οι αποφάσεις πλέον – πείστηκα από ένα TedTalk βιντεάκι στο Youtube. Ποιός δεν πείθεται να κάνει κάτι όταν ακούει από έναν άγνωστο στο ίντερνετ να του μιλάει για μαγεία, επαναστάσεις και πολέμους – όλα μαζεμένα σε ένα βιβλίο του 1967!
          Το 100 Χρόνια Μοναξιά δεν κρύβει τίποτα στον αναγνώστη από τον τίτλο του. Μέσα από την ιστορία της οικογένειας Μπουενδία στο φανταστικό χωριό Μακόντο της Λατινικής Αμερικής, μέσα από τα πάθη, τους έρωτές τους, την βία και την ξενιτιά, παραμονεύει το ύπουλο συναίσθημα της μοναξιάς. Κυριεύει τις σχέσεις των γονιών με τα παιδιά τους, τα αδέλφια, τα εγγόνια και ως αναγνώστης μπορείς μόνο να παρατηρείς τον πόνο και την δυστυχία που φέρνει η ζωή στους πρωταγωνιστές, οι οποίοι έχουν αποδεχτεί την τύχη τους χωρίς παράπονα. Αποτυχημένες εξεργέσεις, μαγεία, υπερφυσική ομορφιά, πάθη που τα επαναλάμβαινε η επόμενη γενιά, προφητείες, όλα διαμορφώνουν τους Μπουενδία και τους συμμαδεύουν ανεπανόρθωτα.
          </h5>
        </div>


        <div class="rightcolumn"> 
            <img border="0" src={"https://i.pinimg.com/236x/13/a5/c2/13a5c2fb97c18b8c25fb8659d0c6adff.jpg"} width="auto" height="auto"/>

        </div>
        

      </body>
    );
}